Revit 2027 API
AirSystemData.ChilledWaterLoopId Property
 The chilled water loop used for the chilled water option of cooling coil.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ChilledWaterLoopId { get; set; }
Public Property ChilledWaterLoopId As ElementId
	Get
	Set
public:
property ElementId^ ChilledWaterLoopId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ChilledWaterLoopId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
AirSystemData Class
Autodesk.Revit.DB.Mechanical Namespace